guixf/xiaozhi-esp32-inksight/main/boards/waveshare/esp32-s-r8n16-ssd1683-4.2/backup/esp32-s-n8d16-ssd1683-4.2_backup_20260609.cc
    void InitializeButtons() {
        boot_button_.OnLongPress([this]() {
            EnterWifiConfigMode();
        });
        boot_button_.OnClick([this]() {
            auto& app = Application::GetInstance();
            if (app.GetDeviceState() == kDeviceStateStarting) {
                EnterWifiConfigMode();
                return;
            }
            app.ToggleChatState();
        });

        ai_button_.OnClick([this]() {
            HandleAiButton();
        });

        ai_button_.OnLongPress([this]() {
            HandleAiButton();
        });

        volume_up_button_.OnClick([this]() {
            auto codec = GetAudioCodec();
            auto volume = codec->output_volume() + 10;
            if (volume > 100) {
                volume = 100;
            }
            codec->SetOutputVolume(volume);
            GetDisplay()->ShowNotification(Lang::Strings::VOLUME + std::to_string(volume));
        });

        volume_up_button_.OnLongPress([this]() {
            GetAudioCodec()->SetOutputVolume(100);
            GetDisplay()->ShowNotification(Lang::Strings::MAX_VOLUME);
        });

        volume_down_button_.OnClick([this]() {
            auto codec = GetAudioCodec();
            auto volume = codec->output_volume() - 10;
            if (volume < 0) {
                volume = 0;
            }
            codec->SetOutputVolume(volume);
            GetDisplay()->ShowNotification(Lang::Strings::VOLUME + std::to_string(volume));
        });

        volume_down_button_.OnLongPress([this]() {
            GetAudioCodec()->SetOutputVolume(0);
            GetDisplay()->ShowNotification(Lang::Strings::MUTED);
        });
    }

    void HandleAiButton() {
        if (in_deep_sleep_) {
            // 检查display_是否已初始化，避免崩溃
            if (display_) {
                WakeFromDeepSleep();
            } else {
                ESP_LOGW(TAG, "[RUNTIME] HandleAiButton: display_ not initialized yet, skipping wake from deep sleep");
            }
            return;
        }
        
        auto& app = Application::GetInstance();
        app.ToggleChatState();
        
        display_->showAiChatStatus("LISTENING", "READY");
    }

    void WakeFromDeepSleep() {
        wakeup_fetch_done_ = false;  // 重置标记，对话结束后需要获取图片
        display_->SetSuppressAutoImageFetch(true);  // 抑制自动获取图片
        
        // 尝试启动对话，但可能在WiFi未连接时无法启动
        auto& app = Application::GetInstance();
        app.ToggleChatState();
        
        // 注意：不要在这里设置 in_deep_sleep_ = false
        // 让 HandleNetworkEventCallback 来处理（WiFi连接后再设置为false）
        
        // 清除NVS唤醒标志（只有成功执行唤醒处理后才清除）
        ClearNvsWakeupFlags();
    }
    
    void ClearNvsWakeupFlags() {
        nvs_handle_t nvs_handle;
        esp_err_t err = nvs_open(NVS_WAKEUP_NAMESPACE, NVS_READWRITE, &nvs_handle);
        if (err == ESP_OK) {
            nvs_set_i32(nvs_handle, NVS_KEY_MARKER, WAKEUP_MARKER_INVALID);
            nvs_set_i32(nvs_handle, NVS_KEY_BUTTON_FLAG, 0);
            nvs_set_i32(nvs_handle, NVS_KEY_TIMER_FLAG, 0);
            nvs_commit(nvs_handle);
            nvs_close(nvs_handle);
            ESP_LOGI(TAG, "[RUNTIME] NVS wakeup flags cleared");
        } else {
            ESP_LOGW(TAG, "[RUNTIME] Failed to clear NVS wakeup flags: %s", esp_err_to_name(err));
        }
    }

    void InitializeTools() {
        auto& mcp_server = McpServer::GetInstance();
        mcp_server.AddTool("self.disp.network", "重新配网", PropertyList(),
                           [this](const PropertyList&) -> ReturnValue {
                               EnterWifiConfigMode();
                               return true;
                           });
    }

    void InitializeDisplay() {
        ssd1683_spi_t epd_spi_data = {};
        epd_spi_data.cs = EPD_CS_PIN;
        epd_spi_data.dc = EPD_DC_PIN;
        epd_spi_data.rst = EPD_RST_PIN;
        epd_spi_data.busy = EPD_BUSY_PIN;
        epd_spi_data.mosi = EPD_MOSI_PIN;
        epd_spi_data.scl = EPD_SCK_PIN;
        epd_spi_data.spi_host = EPD_SPI_NUM;
        epd_spi_data.buffer_len = EXAMPLE_LCD_WIDTH * EXAMPLE_LCD_HEIGHT / 8;
        display_ = new Ssd1683Display(EXAMPLE_LCD_WIDTH, EXAMPLE_LCD_HEIGHT, epd_spi_data);

        display_->EPD_Init();

        // 设置 Inksight 服务配置 - 使用独立的 inksight 服务器地址
        Settings websocket_settings("websocket", false);
        std::string inksight_url = websocket_settings.GetString("inksight_url");
        
        // 如果没有配置独立的 inksight_url，使用默认的 web.inksight.site
        if (inksight_url.empty()) {
            inksight_url = "https://web.inksight.site";
            ESP_LOGI(TAG, "[INKSIGHT] Using default server: %s", inksight_url.c_str());
        }
        
        if (!inksight_url.empty()) {
            display_->SetInksightConfig(inksight_url.c_str());
            ESP_LOGI(TAG, "[INKSIGHT] Configured server: %s", inksight_url.c_str());
            
            // 从 NVS 加载 always_active 配置
            display_->LoadAlwaysActiveFromNVS();
            ESP_LOGI(TAG, "[RUNTIME] Always active mode: %s", display_->IsAlwaysActive() ? "ON" : "OFF");
            
            // 设置运行时模式改变的回调
            display_->SetRuntimeModeChangedCallback([this](bool is_active) {
                ESP_LOGI(TAG, "[RUNTIME] Mode changed to: %s", is_active ? "active" : "interval");
                if (!is_active) {
                    // interval模式下，设备会在fetch完成后进入深度睡眠
                    ESP_LOGI(TAG, "[RUNTIME] Will enter deep sleep after fetch completes");
                } else {
                    // active模式下，保持活跃
                    ESP_LOGI(TAG, "[RUNTIME] Keeping device active");
                }
            });
            
            // 设置进入深度睡眠的回调
            display_->SetDeepSleepCallback([this]() {
                ESP_LOGI(TAG, "[RUNTIME] Deep sleep callback triggered");
                EnterDeepSleep();
            });
            
            // 设置 live mode 定时器回调
            display_->SetLiveModeTimerCallback([this](bool enable) {
                if (enable) {
                    StartLiveModeTimer();
                } else {
                    StopLiveModeTimer();
                }
            });
            
            // 初始化完成后立即触发一次心跳和 pending refresh 检查
            vTaskDelay(pdMS_TO_TICKS(2000));
            ESP_LOGI(TAG, "[RUNTIME] Initial runtime mode: %s", display_->GetRuntimeMode().c_str());
            // 注意：PostRuntimeMode 在 WiFi 连接成功后调用，避免网络栈未就绪
            display_->SendHeartbeat(true);
        } else {
            ESP_LOGW(TAG, "[INKSIGHT] No server URL configured");
        }
    }

    void InitializeBatteryAdc() {
        adc_oneshot_unit_init_cfg_t init_config = {
            .unit_id = ADC_UNIT_1,
        };
        ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config, &adc1_handle_));

        adc_oneshot_chan_cfg_t config = {
            .atten = BATTERY_ADC_ATTEN,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle_, BATTERY_ADC_CHANNEL, &config));

        adc_cali_handle_t handle = NULL;
        esp_err_t ret = ESP_FAIL;
        adc_calibrated_ = false;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
        if (!adc_calibrated_) {
            ESP_LOGI(TAG, "Use curve fitting calibration scheme");
            adc_cali_curve_fitting_config_t cali_config = {
                .unit_id = ADC_UNIT_1,
                .chan = BATTERY_ADC_CHANNEL,
                .atten = BATTERY_ADC_ATTEN,
                .bitwidth = ADC_BITWIDTH_DEFAULT,
            };
            ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
            if (ret == ESP_OK) {
                adc_calibrated_ = true;
            }
        }
#endif

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
        if (!adc_calibrated_) {
            ESP_LOGI(TAG, "Use line fitting calibration scheme");
            adc_cali_line_fitting_config_t cali_config = {
                .unit_id = ADC_UNIT_1,
                .atten = BATTERY_ADC_ATTEN,
                .bitwidth = ADC_BITWIDTH_DEFAULT,
            };
            ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
            if (ret == ESP_OK) {
                adc_calibrated_ = true;
            }
        }
#endif

        adc1_cali_handle_ = handle;
    }

