guixf/xiaozhi-esp32-inksight/main/boards/waveshare/esp32-s-r8n16-ssd1683-4.2/backup/esp32-s-n8d16-ssd1683-4.2_backup_20260609.cc
        // 检查设备状态，如果正在活跃对话（listening/speaking），不进入休眠
        DeviceState state = Application::GetInstance().GetDeviceState();
        ESP_LOGI(TAG, "[RUNTIME] Current device state: %d", state);
        if (state == kDeviceStateListening || state == kDeviceStateSpeaking) {
            ESP_LOGI(TAG, "[RUNTIME] Device is active (state=%d), skipping deep sleep", state);
            return;
        }
        
        display_->EPD_Sleep();
        in_deep_sleep_ = true;
        
        // 获取睡眠时长（从display获取）
        int sleep_minutes = display_->GetSleepMinutes();
        uint64_t sleep_us = (uint64_t)sleep_minutes * 60 * 1000 * 1000;
        ESP_LOGI(TAG, "[RUNTIME] Deep sleep duration: %d minutes (%llu us)", sleep_minutes, sleep_us);
        
        // 断开 WiFi 连接前，先等待一下让其他任务完成
        vTaskDelay(pdMS_TO_TICKS(100));
        
        // 断开 WiFi 连接
        esp_wifi_disconnect();
        esp_wifi_stop();
        
        // 等待 WiFi 完全停止
        vTaskDelay(pdMS_TO_TICKS(200));
        
        // 关键：保存 WiFi 配置到 RTC 内存，实现快速恢复
        esp_err_t err = esp_wifi_restore();
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "[RUNTIME] WiFi config saved to RTC for quick restore");
        } else {
            ESP_LOGI(TAG, "[RUNTIME] WiFi restore result: %s (will need full reconnect)", esp_err_to_name(err));
        }
        
        // 关键：禁用所有唤醒源（清除之前的配置）
        esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_ALL);
        
        // 配置RTC外设电源域，确保唤醒有效
        esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_PERIPH, ESP_PD_OPTION_ON);
        
        // 直接使用RTC GPIO配置（关键：不要混用gpio_config和rtc_gpio_init）
        ESP_ERROR_CHECK(rtc_gpio_init((gpio_num_t)AI_BUTTON_GPIO));
        ESP_ERROR_CHECK(rtc_gpio_set_direction((gpio_num_t)AI_BUTTON_GPIO, RTC_GPIO_MODE_INPUT_ONLY));
        ESP_ERROR_CHECK(rtc_gpio_pullup_en((gpio_num_t)AI_BUTTON_GPIO));  // 启用上拉
        ESP_ERROR_CHECK(rtc_gpio_pulldown_dis((gpio_num_t)AI_BUTTON_GPIO));  // 禁用下拉
        
        // 读取AI按钮状态，检查是否被按下
        int ai_button_state = rtc_gpio_get_level((gpio_num_t)AI_BUTTON_GPIO);
        ESP_LOGI(TAG, "[RUNTIME] AI button state before sleep: %s (GPIO%d)", 
                 ai_button_state ? "HIGH" : "LOW", AI_BUTTON_GPIO);
        
        // 如果按钮被按下（LOW），不进入深度睡眠，避免立即被唤醒
        if (!ai_button_state) {
            ESP_LOGW(TAG, "[RUNTIME] AI button is pressed, skipping deep sleep");
            in_deep_sleep_ = false;
            return;
        }
        
        // 配置GPIO唤醒（使用普通GPIO唤醒，更稳定）
        gpio_wakeup_enable((gpio_num_t)AI_BUTTON_GPIO, GPIO_INTR_LOW_LEVEL);
        esp_sleep_enable_gpio_wakeup();
        ESP_LOGI(TAG, "[RUNTIME] AI button wakeup enabled (GPIO%d, GPIO wakeup, LOW level)", AI_BUTTON_GPIO);
        
        // 配置定时器唤醒
        esp_sleep_enable_timer_wakeup(sleep_us);
        ESP_LOGI(TAG, "[RUNTIME] Timer wakeup enabled");
        
        // 设置NVS唤醒标志（作为esp_sleep_get_wakeup_cause()的备用方案，防止DTR/RTS复位）
        {
            nvs_handle_t nvs_handle;
            esp_err_t err = nvs_open(NVS_WAKEUP_NAMESPACE, NVS_READWRITE, &nvs_handle);
            if (err == ESP_OK) {
                nvs_set_i32(nvs_handle, NVS_KEY_MARKER, WAKEUP_MARKER_VALID);
                nvs_set_i32(nvs_handle, NVS_KEY_BUTTON_FLAG, 1);   // 按键唤醒标志
                nvs_set_i32(nvs_handle, NVS_KEY_TIMER_FLAG, 0);    // 定时器唤醒标志
                nvs_commit(nvs_handle);
                nvs_close(nvs_handle);
                ESP_LOGI(TAG, "[RUNTIME] NVS wakeup flags set (button=1, timer=0)");
            } else {
                ESP_LOGW(TAG, "[RUNTIME] Failed to set NVS wakeup flags: %s", esp_err_to_name(err));
            }
        }
        
        ESP_LOGI(TAG, "[RUNTIME] Going to deep sleep...");
        esp_deep_sleep_start();
    }
};

DECLARE_BOARD(Esp32SN8d16Ssd168342);
